apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_interrupt.h
/****************************************************************************
 * arch/xtensa/src/esp32s2/hardware/interrupt_reg.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_XTENSA_SRC_ESP32S2_HARDWARE_ESP32S2_INTERRUPT_H
#define __ARCH_XTENSA_SRC_ESP32S2_HARDWARE_ESP32S2_INTERRUPT_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "esp32s2_soc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* INTERRUPT_PRO_MAC_INTR_MAP_REG register
 * MAC_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_MAC_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x0)

/* INTERRUPT_PRO_MAC_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map MAC_INTR interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_MAC_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_MAC_INTR_MAP_M  (INTERRUPT_PRO_MAC_INTR_MAP_V << INTERRUPT_PRO_MAC_INTR_MAP_S)
#define INTERRUPT_PRO_MAC_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_MAC_INTR_MAP_S  0

/* INTERRUPT_PRO_MAC_NMI_MAP_REG register
 * MAC_NMI interrupt configuration register
 */

#define INTERRUPT_PRO_MAC_NMI_MAP_REG (DR_REG_INTERRUPT_BASE + 0x4)

/* INTERRUPT_PRO_MAC_NMI_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map MAC_NMI interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_MAC_NMI_MAP    0x0000001F
#define INTERRUPT_PRO_MAC_NMI_MAP_M  (INTERRUPT_PRO_MAC_NMI_MAP_V << INTERRUPT_PRO_MAC_NMI_MAP_S)
#define INTERRUPT_PRO_MAC_NMI_MAP_V  0x0000001F
#define INTERRUPT_PRO_MAC_NMI_MAP_S  0

/* INTERRUPT_PRO_PWR_INTR_MAP_REG register
 * PWR_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_PWR_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x8)

/* INTERRUPT_PRO_PWR_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map PWR_INTR interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_PWR_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_PWR_INTR_MAP_M  (INTERRUPT_PRO_PWR_INTR_MAP_V << INTERRUPT_PRO_PWR_INTR_MAP_S)
#define INTERRUPT_PRO_PWR_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_PWR_INTR_MAP_S  0

/* INTERRUPT_PRO_BB_INT_MAP_REG register
 * BB_INT interrupt configuration register
 */

#define INTERRUPT_PRO_BB_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xc)

/* INTERRUPT_PRO_BB_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map BB_INT interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_BB_INT_MAP    0x0000001F
#define INTERRUPT_PRO_BB_INT_MAP_M  (INTERRUPT_PRO_BB_INT_MAP_V << INTERRUPT_PRO_BB_INT_MAP_S)
#define INTERRUPT_PRO_BB_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_BB_INT_MAP_S  0

/* INTERRUPT_PRO_BT_MAC_INT_MAP_REG register
 * BT_MAC_INT interrupt configuration register
 */

#define INTERRUPT_PRO_BT_MAC_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x10)

/* INTERRUPT_PRO_BT_MAC_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map BT_MAC_INT interrupt signal to one of the
 * CPU interrupts.
 */

#define INTERRUPT_PRO_BT_MAC_INT_MAP    0x0000001F
#define INTERRUPT_PRO_BT_MAC_INT_MAP_M  (INTERRUPT_PRO_BT_MAC_INT_MAP_V << INTERRUPT_PRO_BT_MAC_INT_MAP_S)
#define INTERRUPT_PRO_BT_MAC_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_BT_MAC_INT_MAP_S  0

/* INTERRUPT_PRO_BT_BB_INT_MAP_REG register
 * BT_BB_INT interrupt configuration register
 */

#define INTERRUPT_PRO_BT_BB_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x14)

/* INTERRUPT_PRO_BT_BB_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map BT_BB_INT interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_BT_BB_INT_MAP    0x0000001F
#define INTERRUPT_PRO_BT_BB_INT_MAP_M  (INTERRUPT_PRO_BT_BB_INT_MAP_V << INTERRUPT_PRO_BT_BB_INT_MAP_S)
#define INTERRUPT_PRO_BT_BB_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_BT_BB_INT_MAP_S  0

/* INTERRUPT_PRO_BT_BB_NMI_MAP_REG register
 * BT_BB_NMI interrupt configuration register
 */

#define INTERRUPT_PRO_BT_BB_NMI_MAP_REG (DR_REG_INTERRUPT_BASE + 0x18)

/* INTERRUPT_PRO_BT_BB_NMI_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map BT_BB_NMI interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_BT_BB_NMI_MAP    0x0000001F
#define INTERRUPT_PRO_BT_BB_NMI_MAP_M  (INTERRUPT_PRO_BT_BB_NMI_MAP_V << INTERRUPT_PRO_BT_BB_NMI_MAP_S)
#define INTERRUPT_PRO_BT_BB_NMI_MAP_V  0x0000001F
#define INTERRUPT_PRO_BT_BB_NMI_MAP_S  0

/* INTERRUPT_PRO_RWBT_IRQ_MAP_REG register
 * RWBT_IRQ interrupt configuration register
 */

#define INTERRUPT_PRO_RWBT_IRQ_MAP_REG (DR_REG_INTERRUPT_BASE + 0x1c)

/* INTERRUPT_PRO_RWBT_IRQ_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map RWBT_IRQ interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_RWBT_IRQ_MAP    0x0000001F
#define INTERRUPT_PRO_RWBT_IRQ_MAP_M  (INTERRUPT_PRO_RWBT_IRQ_MAP_V << INTERRUPT_PRO_RWBT_IRQ_MAP_S)
#define INTERRUPT_PRO_RWBT_IRQ_MAP_V  0x0000001F
#define INTERRUPT_PRO_RWBT_IRQ_MAP_S  0

/* INTERRUPT_PRO_RWBLE_IRQ_MAP_REG register
 * RWBLE_IRQ interrupt configuration register
 */

