apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_interrupt.h
#define INTERRUPT_PRO_RWBLE_IRQ_MAP_REG (DR_REG_INTERRUPT_BASE + 0x20)

/* INTERRUPT_PRO_RWBLE_IRQ_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map RWBLE_IRQ interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_RWBLE_IRQ_MAP    0x0000001F
#define INTERRUPT_PRO_RWBLE_IRQ_MAP_M  (INTERRUPT_PRO_RWBLE_IRQ_MAP_V << INTERRUPT_PRO_RWBLE_IRQ_MAP_S)
#define INTERRUPT_PRO_RWBLE_IRQ_MAP_V  0x0000001F
#define INTERRUPT_PRO_RWBLE_IRQ_MAP_S  0

/* INTERRUPT_PRO_RWBT_NMI_MAP_REG register
 * RWBT_NMI interrupt configuration register
 */

#define INTERRUPT_PRO_RWBT_NMI_MAP_REG (DR_REG_INTERRUPT_BASE + 0x24)

/* INTERRUPT_PRO_RWBT_NMI_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map RWBT_NMI interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_RWBT_NMI_MAP    0x0000001F
#define INTERRUPT_PRO_RWBT_NMI_MAP_M  (INTERRUPT_PRO_RWBT_NMI_MAP_V << INTERRUPT_PRO_RWBT_NMI_MAP_S)
#define INTERRUPT_PRO_RWBT_NMI_MAP_V  0x0000001F
#define INTERRUPT_PRO_RWBT_NMI_MAP_S  0

/* INTERRUPT_PRO_RWBLE_NMI_MAP_REG register
 * RWBLE_NMI interrupt configuration register
 */

#define INTERRUPT_PRO_RWBLE_NMI_MAP_REG (DR_REG_INTERRUPT_BASE + 0x28)

/* INTERRUPT_PRO_RWBLE_NMI_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map RWBLE_NMI interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_RWBLE_NMI_MAP    0x0000001F
#define INTERRUPT_PRO_RWBLE_NMI_MAP_M  (INTERRUPT_PRO_RWBLE_NMI_MAP_V << INTERRUPT_PRO_RWBLE_NMI_MAP_S)
#define INTERRUPT_PRO_RWBLE_NMI_MAP_V  0x0000001F
#define INTERRUPT_PRO_RWBLE_NMI_MAP_S  0

/* INTERRUPT_PRO_SLC0_INTR_MAP_REG register
 * SLC0_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_SLC0_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x2c)

/* INTERRUPT_PRO_SLC0_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map SLC0_INTR interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_SLC0_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_SLC0_INTR_MAP_M  (INTERRUPT_PRO_SLC0_INTR_MAP_V << INTERRUPT_PRO_SLC0_INTR_MAP_S)
#define INTERRUPT_PRO_SLC0_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_SLC0_INTR_MAP_S  0

/* INTERRUPT_PRO_SLC1_INTR_MAP_REG register
 * SLC1_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_SLC1_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x30)

/* INTERRUPT_PRO_SLC1_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map SLC1_INTR interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_SLC1_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_SLC1_INTR_MAP_M  (INTERRUPT_PRO_SLC1_INTR_MAP_V << INTERRUPT_PRO_SLC1_INTR_MAP_S)
#define INTERRUPT_PRO_SLC1_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_SLC1_INTR_MAP_S  0

/* INTERRUPT_PRO_UHCI0_INTR_MAP_REG register
 * UHCI0_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_UHCI0_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x34)

/* INTERRUPT_PRO_UHCI0_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map UHCI0_INTR interrupt signal to one of the
 * CPU interrupts.
 */

#define INTERRUPT_PRO_UHCI0_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_UHCI0_INTR_MAP_M  (INTERRUPT_PRO_UHCI0_INTR_MAP_V << INTERRUPT_PRO_UHCI0_INTR_MAP_S)
#define INTERRUPT_PRO_UHCI0_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_UHCI0_INTR_MAP_S  0

/* INTERRUPT_PRO_UHCI1_INTR_MAP_REG register
 * UHCI1_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_UHCI1_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x38)

/* INTERRUPT_PRO_UHCI1_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map UHCI1_INTR interrupt signal to one of the
 * CPU interrupts.
 */

#define INTERRUPT_PRO_UHCI1_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_UHCI1_INTR_MAP_M  (INTERRUPT_PRO_UHCI1_INTR_MAP_V << INTERRUPT_PRO_UHCI1_INTR_MAP_S)
#define INTERRUPT_PRO_UHCI1_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_UHCI1_INTR_MAP_S  0

/* INTERRUPT_PRO_TG_T0_LEVEL_INT_MAP_REG register
 * TG_T0_LEVEL_INT interrupt configuration register
 */

#define INTERRUPT_PRO_TG_T0_LEVEL_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x3c)

/* INTERRUPT_PRO_TG_T0_LEVEL_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map TG_T0_LEVEL_INT interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_TG_T0_LEVEL_INT_MAP    0x0000001F
#define INTERRUPT_PRO_TG_T0_LEVEL_INT_MAP_M  (INTERRUPT_PRO_TG_T0_LEVEL_INT_MAP_V << INTERRUPT_PRO_TG_T0_LEVEL_INT_MAP_S)
#define INTERRUPT_PRO_TG_T0_LEVEL_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_TG_T0_LEVEL_INT_MAP_S  0

/* INTERRUPT_PRO_TG_T1_LEVEL_INT_MAP_REG register
 * TG_T1_LEVEL_INT interrupt configuration register
 */

#define INTERRUPT_PRO_TG_T1_LEVEL_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x40)

/* INTERRUPT_PRO_TG_T1_LEVEL_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map TG_T1_LEVEL_INT interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_TG_T1_LEVEL_INT_MAP    0x0000001F
#define INTERRUPT_PRO_TG_T1_LEVEL_INT_MAP_M  (INTERRUPT_PRO_TG_T1_LEVEL_INT_MAP_V << INTERRUPT_PRO_TG_T1_LEVEL_INT_MAP_S)
#define INTERRUPT_PRO_TG_T1_LEVEL_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_TG_T1_LEVEL_INT_MAP_S  0

/* INTERRUPT_PRO_TG_WDT_LEVEL_INT_MAP_REG register
 * TG_WDT_LEVEL_INT interrupt configuration register
 */

#define INTERRUPT_PRO_TG_WDT_LEVEL_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x44)

/* INTERRUPT_PRO_TG_WDT_LEVEL_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map TG_WDT_LEVEL_INT interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_TG_WDT_LEVEL_INT_MAP    0x0000001F
#define INTERRUPT_PRO_TG_WDT_LEVEL_INT_MAP_M  (INTERRUPT_PRO_TG_WDT_LEVEL_INT_MAP_V << INTERRUPT_PRO_TG_WDT_LEVEL_INT_MAP_S)
#define INTERRUPT_PRO_TG_WDT_LEVEL_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_TG_WDT_LEVEL_INT_MAP_S  0

/* INTERRUPT_PRO_TG_LACT_LEVEL_INT_MAP_REG register
 * TG_LACT_LEVEL_INT interrupt configuration register
 */

#define INTERRUPT_PRO_TG_LACT_LEVEL_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x48)

