apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_interrupt.h
/* INTERRUPT_PRO_TG_LACT_LEVEL_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map TG_LACT_LEVEL_INT interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_TG_LACT_LEVEL_INT_MAP    0x0000001F
#define INTERRUPT_PRO_TG_LACT_LEVEL_INT_MAP_M  (INTERRUPT_PRO_TG_LACT_LEVEL_INT_MAP_V << INTERRUPT_PRO_TG_LACT_LEVEL_INT_MAP_S)
#define INTERRUPT_PRO_TG_LACT_LEVEL_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_TG_LACT_LEVEL_INT_MAP_S  0

/* INTERRUPT_PRO_TG1_T0_LEVEL_INT_MAP_REG register
 * TG1_T0_LEVEL_INT interrupt configuration register
 */

#define INTERRUPT_PRO_TG1_T0_LEVEL_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x4c)

/* INTERRUPT_PRO_TG1_T0_LEVEL_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map TG1_T0_LEVEL_INT interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_TG1_T0_LEVEL_INT_MAP    0x0000001F
#define INTERRUPT_PRO_TG1_T0_LEVEL_INT_MAP_M  (INTERRUPT_PRO_TG1_T0_LEVEL_INT_MAP_V << INTERRUPT_PRO_TG1_T0_LEVEL_INT_MAP_S)
#define INTERRUPT_PRO_TG1_T0_LEVEL_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_TG1_T0_LEVEL_INT_MAP_S  0

/* INTERRUPT_PRO_TG1_T1_LEVEL_INT_MAP_REG register
 * TG1_T1_LEVEL_INT interrupt configuration register
 */

#define INTERRUPT_PRO_TG1_T1_LEVEL_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x50)

/* INTERRUPT_PRO_TG1_T1_LEVEL_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map TG1_T1_LEVEL_INT interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_TG1_T1_LEVEL_INT_MAP    0x0000001F
#define INTERRUPT_PRO_TG1_T1_LEVEL_INT_MAP_M  (INTERRUPT_PRO_TG1_T1_LEVEL_INT_MAP_V << INTERRUPT_PRO_TG1_T1_LEVEL_INT_MAP_S)
#define INTERRUPT_PRO_TG1_T1_LEVEL_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_TG1_T1_LEVEL_INT_MAP_S  0

/* INTERRUPT_PRO_TG1_WDT_LEVEL_INT_MAP_REG register
 * TG1_WDT_LEVEL_INT interrupt configuration register
 */

#define INTERRUPT_PRO_TG1_WDT_LEVEL_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x54)

/* INTERRUPT_PRO_TG1_WDT_LEVEL_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map TG1_WDT_LEVEL_INT interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_TG1_WDT_LEVEL_INT_MAP    0x0000001F
#define INTERRUPT_PRO_TG1_WDT_LEVEL_INT_MAP_M  (INTERRUPT_PRO_TG1_WDT_LEVEL_INT_MAP_V << INTERRUPT_PRO_TG1_WDT_LEVEL_INT_MAP_S)
#define INTERRUPT_PRO_TG1_WDT_LEVEL_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_TG1_WDT_LEVEL_INT_MAP_S  0

/* INTERRUPT_PRO_TG1_LACT_LEVEL_INT_MAP_REG register
 * TG1_LACT_LEVEL_INT interrupt configuration register
 */

#define INTERRUPT_PRO_TG1_LACT_LEVEL_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x58)

/* INTERRUPT_PRO_TG1_LACT_LEVEL_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map TG1_LACT_LEVEL_INT interrupt signal to one
 * of the CPU interrupts.
 */

#define INTERRUPT_PRO_TG1_LACT_LEVEL_INT_MAP    0x0000001F
#define INTERRUPT_PRO_TG1_LACT_LEVEL_INT_MAP_M  (INTERRUPT_PRO_TG1_LACT_LEVEL_INT_MAP_V << INTERRUPT_PRO_TG1_LACT_LEVEL_INT_MAP_S)
#define INTERRUPT_PRO_TG1_LACT_LEVEL_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_TG1_LACT_LEVEL_INT_MAP_S  0

/* INTERRUPT_PRO_GPIO_INTERRUPT_PRO_MAP_REG register
 * GPIO_INTERRUPT_PRO interrupt configuration register
 */

#define INTERRUPT_PRO_GPIO_INTERRUPT_PRO_MAP_REG (DR_REG_INTERRUPT_BASE + 0x5c)

/* INTERRUPT_PRO_GPIO_INTERRUPT_PRO_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map GPIO_INTERRUPT_PRO interrupt signal to one
 * of the CPU interrupts.
 */

#define INTERRUPT_PRO_GPIO_INTERRUPT_PRO_MAP    0x0000001F
#define INTERRUPT_PRO_GPIO_INTERRUPT_PRO_MAP_M  (INTERRUPT_PRO_GPIO_INTERRUPT_PRO_MAP_V << INTERRUPT_PRO_GPIO_INTERRUPT_PRO_MAP_S)
#define INTERRUPT_PRO_GPIO_INTERRUPT_PRO_MAP_V  0x0000001F
#define INTERRUPT_PRO_GPIO_INTERRUPT_PRO_MAP_S  0

/* INTERRUPT_PRO_GPIO_INTERRUPT_PRO_NMI_MAP_REG register
 * GPIO_INTERRUPT_PRO_NMI interrupt configuration register
 */

#define INTERRUPT_PRO_GPIO_INTERRUPT_PRO_NMI_MAP_REG (DR_REG_INTERRUPT_BASE + 0x60)

/* INTERRUPT_PRO_GPIO_INTERRUPT_PRO_NMI_MAP : R/W; bitpos: [4:0]; default:
 * 16;
 * This register is used to map GPIO_INTERRUPT_PRO_NMI interrupt signal to
 * one of the CPU interrupts.
 */

#define INTERRUPT_PRO_GPIO_INTERRUPT_PRO_NMI_MAP    0x0000001F
#define INTERRUPT_PRO_GPIO_INTERRUPT_PRO_NMI_MAP_M  (INTERRUPT_PRO_GPIO_INTERRUPT_PRO_NMI_MAP_V << INTERRUPT_PRO_GPIO_INTERRUPT_PRO_NMI_MAP_S)
#define INTERRUPT_PRO_GPIO_INTERRUPT_PRO_NMI_MAP_V  0x0000001F
#define INTERRUPT_PRO_GPIO_INTERRUPT_PRO_NMI_MAP_S  0

/* INTERRUPT_PRO_GPIO_INTERRUPT_APP_MAP_REG register
 * GPIO_INTERRUPT_APP interrupt configuration register
 */

#define INTERRUPT_PRO_GPIO_INTERRUPT_APP_MAP_REG (DR_REG_INTERRUPT_BASE + 0x64)

/* INTERRUPT_PRO_GPIO_INTERRUPT_APP_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map GPIO_INTERRUPT_APP interrupt signal to one
 * of the CPU interrupts.
 */

#define INTERRUPT_PRO_GPIO_INTERRUPT_APP_MAP    0x0000001F
#define INTERRUPT_PRO_GPIO_INTERRUPT_APP_MAP_M  (INTERRUPT_PRO_GPIO_INTERRUPT_APP_MAP_V << INTERRUPT_PRO_GPIO_INTERRUPT_APP_MAP_S)
#define INTERRUPT_PRO_GPIO_INTERRUPT_APP_MAP_V  0x0000001F
#define INTERRUPT_PRO_GPIO_INTERRUPT_APP_MAP_S  0

/* INTERRUPT_PRO_GPIO_INTERRUPT_APP_NMI_MAP_REG register
 * GPIO_INTERRUPT_APP_NMI interrupt configuration register
 */

#define INTERRUPT_PRO_GPIO_INTERRUPT_APP_NMI_MAP_REG (DR_REG_INTERRUPT_BASE + 0x68)

/* INTERRUPT_PRO_GPIO_INTERRUPT_APP_NMI_MAP : R/W; bitpos: [4:0]; default:
 * 16;
 * This register is used to map GPIO_INTERRUPT_APP_NMI interrupt signal to
 * one of the CPU interrupts.
 */

#define INTERRUPT_PRO_GPIO_INTERRUPT_APP_NMI_MAP    0x0000001F
#define INTERRUPT_PRO_GPIO_INTERRUPT_APP_NMI_MAP_M  (INTERRUPT_PRO_GPIO_INTERRUPT_APP_NMI_MAP_V << INTERRUPT_PRO_GPIO_INTERRUPT_APP_NMI_MAP_S)
#define INTERRUPT_PRO_GPIO_INTERRUPT_APP_NMI_MAP_V  0x0000001F
#define INTERRUPT_PRO_GPIO_INTERRUPT_APP_NMI_MAP_S  0

/* INTERRUPT_PRO_DEDICATED_GPIO_IN_INTR_MAP_REG register
 * DEDICATED_GPIO_IN_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_DEDICATED_GPIO_IN_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x6c)

/* INTERRUPT_PRO_DEDICATED_GPIO_IN_INTR_MAP : R/W; bitpos: [4:0]; default:
 * 16;
 * This register is used to map DEDICATED_GPIO_IN_INTR interrupt signal to
 * one of the CPU interrupts.
 */

#define INTERRUPT_PRO_DEDICATED_GPIO_IN_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_DEDICATED_GPIO_IN_INTR_MAP_M  (INTERRUPT_PRO_DEDICATED_GPIO_IN_INTR_MAP_V << INTERRUPT_PRO_DEDICATED_GPIO_IN_INTR_MAP_S)
#define INTERRUPT_PRO_DEDICATED_GPIO_IN_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_DEDICATED_GPIO_IN_INTR_MAP_S  0

/* INTERRUPT_PRO_CPU_INTR_FROM_CPU_0_MAP_REG register
 * CPU_INTR_FROM_CPU_0 interrupt configuration register
 */

#define INTERRUPT_PRO_CPU_INTR_FROM_CPU_0_MAP_REG (DR_REG_INTERRUPT_BASE + 0x70)

/* INTERRUPT_PRO_CPU_INTR_FROM_CPU_0_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map CPU_INTR_FROM_CPU_0 interrupt signal to one
 * of the CPU interrupts.
 */

#define INTERRUPT_PRO_CPU_INTR_FROM_CPU_0_MAP    0x0000001F
#define INTERRUPT_PRO_CPU_INTR_FROM_CPU_0_MAP_M  (INTERRUPT_PRO_CPU_INTR_FROM_CPU_0_MAP_V << INTERRUPT_PRO_CPU_INTR_FROM_CPU_0_MAP_S)
#define INTERRUPT_PRO_CPU_INTR_FROM_CPU_0_MAP_V  0x0000001F
#define INTERRUPT_PRO_CPU_INTR_FROM_CPU_0_MAP_S  0

/* INTERRUPT_PRO_CPU_INTR_FROM_CPU_1_MAP_REG register
 * CPU_INTR_FROM_CPU_1 interrupt configuration register
 */

#define INTERRUPT_PRO_CPU_INTR_FROM_CPU_1_MAP_REG (DR_REG_INTERRUPT_BASE + 0x74)

/* INTERRUPT_PRO_CPU_INTR_FROM_CPU_1_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map CPU_INTR_FROM_CPU_1 interrupt signal to one
 * of the CPU interrupts.
 */

#define INTERRUPT_PRO_CPU_INTR_FROM_CPU_1_MAP    0x0000001F
#define INTERRUPT_PRO_CPU_INTR_FROM_CPU_1_MAP_M  (INTERRUPT_PRO_CPU_INTR_FROM_CPU_1_MAP_V << INTERRUPT_PRO_CPU_INTR_FROM_CPU_1_MAP_S)
#define INTERRUPT_PRO_CPU_INTR_FROM_CPU_1_MAP_V  0x0000001F
#define INTERRUPT_PRO_CPU_INTR_FROM_CPU_1_MAP_S  0

/* INTERRUPT_PRO_CPU_INTR_FROM_CPU_2_MAP_REG register
 * CPU_INTR_FROM_CPU_2 interrupt configuration register
 */

#define INTERRUPT_PRO_CPU_INTR_FROM_CPU_2_MAP_REG (DR_REG_INTERRUPT_BASE + 0x78)

/* INTERRUPT_PRO_CPU_INTR_FROM_CPU_2_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map CPU_INTR_FROM_CPU_2 interrupt signal to one
 * of the CPU interrupts.
 */

#define INTERRUPT_PRO_CPU_INTR_FROM_CPU_2_MAP    0x0000001F
#define INTERRUPT_PRO_CPU_INTR_FROM_CPU_2_MAP_M  (INTERRUPT_PRO_CPU_INTR_FROM_CPU_2_MAP_V << INTERRUPT_PRO_CPU_INTR_FROM_CPU_2_MAP_S)
#define INTERRUPT_PRO_CPU_INTR_FROM_CPU_2_MAP_V  0x0000001F
#define INTERRUPT_PRO_CPU_INTR_FROM_CPU_2_MAP_S  0

