apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_interrupt.h
/* INTERRUPT_PRO_CPU_INTR_FROM_CPU_3_MAP_REG register
 * CPU_INTR_FROM_CPU_3 interrupt configuration register
 */

#define INTERRUPT_PRO_CPU_INTR_FROM_CPU_3_MAP_REG (DR_REG_INTERRUPT_BASE + 0x7c)

/* INTERRUPT_PRO_CPU_INTR_FROM_CPU_3_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map CPU_INTR_FROM_CPU_3 interrupt signal to one
 * of the CPU interrupts.
 */

#define INTERRUPT_PRO_CPU_INTR_FROM_CPU_3_MAP    0x0000001F
#define INTERRUPT_PRO_CPU_INTR_FROM_CPU_3_MAP_M  (INTERRUPT_PRO_CPU_INTR_FROM_CPU_3_MAP_V << INTERRUPT_PRO_CPU_INTR_FROM_CPU_3_MAP_S)
#define INTERRUPT_PRO_CPU_INTR_FROM_CPU_3_MAP_V  0x0000001F
#define INTERRUPT_PRO_CPU_INTR_FROM_CPU_3_MAP_S  0

/* INTERRUPT_PRO_SPI_INTR_1_MAP_REG register
 * SPI_INTR_1 interrupt configuration register
 */

#define INTERRUPT_PRO_SPI_INTR_1_MAP_REG (DR_REG_INTERRUPT_BASE + 0x80)

/* INTERRUPT_PRO_SPI_INTR_1_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map SPI_INTR_1 interrupt signal to one of the
 * CPU interrupts.
 */

#define INTERRUPT_PRO_SPI_INTR_1_MAP    0x0000001F
#define INTERRUPT_PRO_SPI_INTR_1_MAP_M  (INTERRUPT_PRO_SPI_INTR_1_MAP_V << INTERRUPT_PRO_SPI_INTR_1_MAP_S)
#define INTERRUPT_PRO_SPI_INTR_1_MAP_V  0x0000001F
#define INTERRUPT_PRO_SPI_INTR_1_MAP_S  0

/* INTERRUPT_PRO_SPI_INTR_2_MAP_REG register
 * SPI_INTR_2 interrupt configuration register
 */

#define INTERRUPT_PRO_SPI_INTR_2_MAP_REG (DR_REG_INTERRUPT_BASE + 0x84)

/* INTERRUPT_PRO_SPI_INTR_2_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map SPI_INTR_2 interrupt signal to one of the
 * CPU interrupts.
 */

#define INTERRUPT_PRO_SPI_INTR_2_MAP    0x0000001F
#define INTERRUPT_PRO_SPI_INTR_2_MAP_M  (INTERRUPT_PRO_SPI_INTR_2_MAP_V << INTERRUPT_PRO_SPI_INTR_2_MAP_S)
#define INTERRUPT_PRO_SPI_INTR_2_MAP_V  0x0000001F
#define INTERRUPT_PRO_SPI_INTR_2_MAP_S  0

/* INTERRUPT_PRO_SPI_INTR_3_MAP_REG register
 * SPI_INTR_3 interrupt configuration register
 */

#define INTERRUPT_PRO_SPI_INTR_3_MAP_REG (DR_REG_INTERRUPT_BASE + 0x88)

/* INTERRUPT_PRO_SPI_INTR_3_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map SPI_INTR_3 interrupt signal to one of the
 * CPU interrupts.
 */

#define INTERRUPT_PRO_SPI_INTR_3_MAP    0x0000001F
#define INTERRUPT_PRO_SPI_INTR_3_MAP_M  (INTERRUPT_PRO_SPI_INTR_3_MAP_V << INTERRUPT_PRO_SPI_INTR_3_MAP_S)
#define INTERRUPT_PRO_SPI_INTR_3_MAP_V  0x0000001F
#define INTERRUPT_PRO_SPI_INTR_3_MAP_S  0

/* INTERRUPT_PRO_I2S0_INT_MAP_REG register
 * I2S0_INT interrupt configuration register
 */

#define INTERRUPT_PRO_I2S0_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x8c)

/* INTERRUPT_PRO_I2S0_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map I2S0_INT interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_I2S0_INT_MAP    0x0000001F
#define INTERRUPT_PRO_I2S0_INT_MAP_M  (INTERRUPT_PRO_I2S0_INT_MAP_V << INTERRUPT_PRO_I2S0_INT_MAP_S)
#define INTERRUPT_PRO_I2S0_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_I2S0_INT_MAP_S  0

/* INTERRUPT_PRO_I2S1_INT_MAP_REG register
 * I2S1_INT interrupt configuration register
 */

#define INTERRUPT_PRO_I2S1_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x90)

/* INTERRUPT_PRO_I2S1_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map I2S1_INT interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_I2S1_INT_MAP    0x0000001F
#define INTERRUPT_PRO_I2S1_INT_MAP_M  (INTERRUPT_PRO_I2S1_INT_MAP_V << INTERRUPT_PRO_I2S1_INT_MAP_S)
#define INTERRUPT_PRO_I2S1_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_I2S1_INT_MAP_S  0

/* INTERRUPT_PRO_UART_INTR_MAP_REG register
 * UART_INT interrupt configuration register
 */

#define INTERRUPT_PRO_UART_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x94)

/* INTERRUPT_PRO_UART_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map UART_INT interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_UART_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_UART_INTR_MAP_M  (INTERRUPT_PRO_UART_INTR_MAP_V << INTERRUPT_PRO_UART_INTR_MAP_S)
#define INTERRUPT_PRO_UART_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_UART_INTR_MAP_S  0

/* INTERRUPT_PRO_UART1_INTR_MAP_REG register
 * UART1_INT interrupt configuration register
 */

#define INTERRUPT_PRO_UART1_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x98)

/* INTERRUPT_PRO_UART1_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map UART1_INT interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_UART1_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_UART1_INTR_MAP_M  (INTERRUPT_PRO_UART1_INTR_MAP_V << INTERRUPT_PRO_UART1_INTR_MAP_S)
#define INTERRUPT_PRO_UART1_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_UART1_INTR_MAP_S  0

/* INTERRUPT_PRO_UART2_INTR_MAP_REG register
 * UART2_INT interrupt configuration register
 */

#define INTERRUPT_PRO_UART2_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x9c)

/* INTERRUPT_PRO_UART2_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map UART2_INT interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_UART2_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_UART2_INTR_MAP_M  (INTERRUPT_PRO_UART2_INTR_MAP_V << INTERRUPT_PRO_UART2_INTR_MAP_S)
#define INTERRUPT_PRO_UART2_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_UART2_INTR_MAP_S  0

/* INTERRUPT_PRO_SDIO_HOST_INTERRUPT_MAP_REG register
 * SDIO_HOST_INTERRUPT configuration register
 */

#define INTERRUPT_PRO_SDIO_HOST_INTERRUPT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xa0)

/* INTERRUPT_PRO_SDIO_HOST_INTERRUPT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map SDIO_HOST_INTERRUPT signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_SDIO_HOST_INTERRUPT_MAP    0x0000001F
#define INTERRUPT_PRO_SDIO_HOST_INTERRUPT_MAP_M  (INTERRUPT_PRO_SDIO_HOST_INTERRUPT_MAP_V << INTERRUPT_PRO_SDIO_HOST_INTERRUPT_MAP_S)
#define INTERRUPT_PRO_SDIO_HOST_INTERRUPT_MAP_V  0x0000001F
#define INTERRUPT_PRO_SDIO_HOST_INTERRUPT_MAP_S  0

/* INTERRUPT_PRO_PWM0_INTR_MAP_REG register
 * PWM0_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_PWM0_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0xa4)

/* INTERRUPT_PRO_PWM0_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map PWM0_INTR interrupt signal to one of the CPU
 * interrupts.
 */

