apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_interrupt.h
#define INTERRUPT_PRO_PWM0_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_PWM0_INTR_MAP_M  (INTERRUPT_PRO_PWM0_INTR_MAP_V << INTERRUPT_PRO_PWM0_INTR_MAP_S)
#define INTERRUPT_PRO_PWM0_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_PWM0_INTR_MAP_S  0

/* INTERRUPT_PRO_PWM1_INTR_MAP_REG register
 * PWM1_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_PWM1_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0xa8)

/* INTERRUPT_PRO_PWM1_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map PWM1_INTR interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_PWM1_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_PWM1_INTR_MAP_M  (INTERRUPT_PRO_PWM1_INTR_MAP_V << INTERRUPT_PRO_PWM1_INTR_MAP_S)
#define INTERRUPT_PRO_PWM1_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_PWM1_INTR_MAP_S  0

/* INTERRUPT_PRO_PWM2_INTR_MAP_REG register
 * PWM2_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_PWM2_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0xac)

/* INTERRUPT_PRO_PWM2_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map PWM2_INTR interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_PWM2_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_PWM2_INTR_MAP_M  (INTERRUPT_PRO_PWM2_INTR_MAP_V << INTERRUPT_PRO_PWM2_INTR_MAP_S)
#define INTERRUPT_PRO_PWM2_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_PWM2_INTR_MAP_S  0

/* INTERRUPT_PRO_PWM3_INTR_MAP_REG register
 * PWM3_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_PWM3_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0xb0)

/* INTERRUPT_PRO_PWM3_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map PWM3_INTR interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_PWM3_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_PWM3_INTR_MAP_M  (INTERRUPT_PRO_PWM3_INTR_MAP_V << INTERRUPT_PRO_PWM3_INTR_MAP_S)
#define INTERRUPT_PRO_PWM3_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_PWM3_INTR_MAP_S  0

/* INTERRUPT_PRO_LEDC_INT_MAP_REG register
 * LEDC_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_LEDC_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xb4)

/* INTERRUPT_PRO_LEDC_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map LEDC_INTR interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_LEDC_INT_MAP    0x0000001F
#define INTERRUPT_PRO_LEDC_INT_MAP_M  (INTERRUPT_PRO_LEDC_INT_MAP_V << INTERRUPT_PRO_LEDC_INT_MAP_S)
#define INTERRUPT_PRO_LEDC_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_LEDC_INT_MAP_S  0

/* INTERRUPT_PRO_EFUSE_INT_MAP_REG register
 * EFUSE_INT interrupt configuration register
 */

#define INTERRUPT_PRO_EFUSE_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xb8)

/* INTERRUPT_PRO_EFUSE_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map EFUSE_INT interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_EFUSE_INT_MAP    0x0000001F
#define INTERRUPT_PRO_EFUSE_INT_MAP_M  (INTERRUPT_PRO_EFUSE_INT_MAP_V << INTERRUPT_PRO_EFUSE_INT_MAP_S)
#define INTERRUPT_PRO_EFUSE_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_EFUSE_INT_MAP_S  0

/* INTERRUPT_PRO_CAN_INT_MAP_REG register
 * CAN_INT interrupt configuration register
 */

#define INTERRUPT_PRO_CAN_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xbc)

/* INTERRUPT_PRO_CAN_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map CAN_INT interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_CAN_INT_MAP    0x0000001F
#define INTERRUPT_PRO_CAN_INT_MAP_M  (INTERRUPT_PRO_CAN_INT_MAP_V << INTERRUPT_PRO_CAN_INT_MAP_S)
#define INTERRUPT_PRO_CAN_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_CAN_INT_MAP_S  0

/* INTERRUPT_PRO_USB_INTR_MAP_REG register
 * USB_INT interrupt configuration register
 */

#define INTERRUPT_PRO_USB_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0xc0)

/* INTERRUPT_PRO_USB_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map USB_INT interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_USB_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_USB_INTR_MAP_M  (INTERRUPT_PRO_USB_INTR_MAP_V << INTERRUPT_PRO_USB_INTR_MAP_S)
#define INTERRUPT_PRO_USB_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_USB_INTR_MAP_S  0

/* INTERRUPT_PRO_RTC_CORE_INTR_MAP_REG register
 * RTC_CORE_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_RTC_CORE_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0xc4)

/* INTERRUPT_PRO_RTC_CORE_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map RTC_CORE_INTR interrupt signal to one of the
 * CPU interrupts.
 */

#define INTERRUPT_PRO_RTC_CORE_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_RTC_CORE_INTR_MAP_M  (INTERRUPT_PRO_RTC_CORE_INTR_MAP_V << INTERRUPT_PRO_RTC_CORE_INTR_MAP_S)
#define INTERRUPT_PRO_RTC_CORE_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_RTC_CORE_INTR_MAP_S  0

/* INTERRUPT_PRO_RMT_INTR_MAP_REG register
 * RMT_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_RMT_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0xc8)

/* INTERRUPT_PRO_RMT_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map RMT_INTR interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_RMT_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_RMT_INTR_MAP_M  (INTERRUPT_PRO_RMT_INTR_MAP_V << INTERRUPT_PRO_RMT_INTR_MAP_S)
#define INTERRUPT_PRO_RMT_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_RMT_INTR_MAP_S  0

/* INTERRUPT_PRO_PCNT_INTR_MAP_REG register
 * PCNT_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_PCNT_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0xcc)

/* INTERRUPT_PRO_PCNT_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map PCNT_INTR interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_PCNT_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_PCNT_INTR_MAP_M  (INTERRUPT_PRO_PCNT_INTR_MAP_V << INTERRUPT_PRO_PCNT_INTR_MAP_S)
#define INTERRUPT_PRO_PCNT_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_PCNT_INTR_MAP_S  0

/* INTERRUPT_PRO_I2C_EXT0_INTR_MAP_REG register
 * I2C_EXT0_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_I2C_EXT0_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0xd0)

/* INTERRUPT_PRO_I2C_EXT0_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map I2C_EXT0_INTR interrupt signal to one of the
 * CPU interrupts.
 */

