apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_interrupt.h
#define INTERRUPT_PRO_I2C_EXT0_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_I2C_EXT0_INTR_MAP_M  (INTERRUPT_PRO_I2C_EXT0_INTR_MAP_V << INTERRUPT_PRO_I2C_EXT0_INTR_MAP_S)
#define INTERRUPT_PRO_I2C_EXT0_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_I2C_EXT0_INTR_MAP_S  0

/* INTERRUPT_PRO_I2C_EXT1_INTR_MAP_REG register
 * I2C_EXT1_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_I2C_EXT1_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0xd4)

/* INTERRUPT_PRO_I2C_EXT1_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map I2C_EXT1_INTR interrupt signal to one of the
 * CPU interrupts.
 */

#define INTERRUPT_PRO_I2C_EXT1_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_I2C_EXT1_INTR_MAP_M  (INTERRUPT_PRO_I2C_EXT1_INTR_MAP_V << INTERRUPT_PRO_I2C_EXT1_INTR_MAP_S)
#define INTERRUPT_PRO_I2C_EXT1_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_I2C_EXT1_INTR_MAP_S  0

/* INTERRUPT_PRO_RSA_INTR_MAP_REG register
 * RSA_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_RSA_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0xd8)

/* INTERRUPT_PRO_RSA_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map RSA_INTR interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_RSA_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_RSA_INTR_MAP_M  (INTERRUPT_PRO_RSA_INTR_MAP_V << INTERRUPT_PRO_RSA_INTR_MAP_S)
#define INTERRUPT_PRO_RSA_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_RSA_INTR_MAP_S  0

/* INTERRUPT_PRO_SHA_INTR_MAP_REG register
 * SHA_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_SHA_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0xdc)

/* INTERRUPT_PRO_SHA_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map SHA_INTR interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_SHA_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_SHA_INTR_MAP_M  (INTERRUPT_PRO_SHA_INTR_MAP_V << INTERRUPT_PRO_SHA_INTR_MAP_S)
#define INTERRUPT_PRO_SHA_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_SHA_INTR_MAP_S  0

/* INTERRUPT_PRO_AES_INTR_MAP_REG register
 * AES_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_AES_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0xe0)

/* INTERRUPT_PRO_AES_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map AES_INTR interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_AES_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_AES_INTR_MAP_M  (INTERRUPT_PRO_AES_INTR_MAP_V << INTERRUPT_PRO_AES_INTR_MAP_S)
#define INTERRUPT_PRO_AES_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_AES_INTR_MAP_S  0

/* INTERRUPT_PRO_SPI2_DMA_INT_MAP_REG register
 * SPI2_DMA_INT interrupt configuration register
 */

#define INTERRUPT_PRO_SPI2_DMA_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xe4)

/* INTERRUPT_PRO_SPI2_DMA_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map AES_INTR interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_SPI2_DMA_INT_MAP    0x0000001F
#define INTERRUPT_PRO_SPI2_DMA_INT_MAP_M  (INTERRUPT_PRO_SPI2_DMA_INT_MAP_V << INTERRUPT_PRO_SPI2_DMA_INT_MAP_S)
#define INTERRUPT_PRO_SPI2_DMA_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_SPI2_DMA_INT_MAP_S  0

/* INTERRUPT_PRO_SPI3_DMA_INT_MAP_REG register
 * SPI3_DMA_INT interrupt configuration register
 */

#define INTERRUPT_PRO_SPI3_DMA_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xe8)

/* INTERRUPT_PRO_SPI3_DMA_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map SPI3_DMA_INT dma interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_SPI3_DMA_INT_MAP    0x0000001F
#define INTERRUPT_PRO_SPI3_DMA_INT_MAP_M  (INTERRUPT_PRO_SPI3_DMA_INT_MAP_V << INTERRUPT_PRO_SPI3_DMA_INT_MAP_S)
#define INTERRUPT_PRO_SPI3_DMA_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_SPI3_DMA_INT_MAP_S  0

/* INTERRUPT_PRO_WDG_INT_MAP_REG register
 * WDG_INT interrupt configuration register
 */

#define INTERRUPT_PRO_WDG_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xec)

/* INTERRUPT_PRO_WDG_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map WDG_INT interrupt signal to one of the CPU
 * interrupts.
 */

#define INTERRUPT_PRO_WDG_INT_MAP    0x0000001F
#define INTERRUPT_PRO_WDG_INT_MAP_M  (INTERRUPT_PRO_WDG_INT_MAP_V << INTERRUPT_PRO_WDG_INT_MAP_S)
#define INTERRUPT_PRO_WDG_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_WDG_INT_MAP_S  0

/* INTERRUPT_PRO_TIMER_INT1_MAP_REG register
 * TIMER_INT1 interrupt configuration register
 */

#define INTERRUPT_PRO_TIMER_INT1_MAP_REG (DR_REG_INTERRUPT_BASE + 0xf0)

/* INTERRUPT_PRO_TIMER_INT1_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map TIMER_INT1 interrupt signal to one of the
 * CPU interrupts.
 */

#define INTERRUPT_PRO_TIMER_INT1_MAP    0x0000001F
#define INTERRUPT_PRO_TIMER_INT1_MAP_M  (INTERRUPT_PRO_TIMER_INT1_MAP_V << INTERRUPT_PRO_TIMER_INT1_MAP_S)
#define INTERRUPT_PRO_TIMER_INT1_MAP_V  0x0000001F
#define INTERRUPT_PRO_TIMER_INT1_MAP_S  0

/* INTERRUPT_PRO_TIMER_INT2_MAP_REG register
 * TIMER_INT2 interrupt configuration register
 */

#define INTERRUPT_PRO_TIMER_INT2_MAP_REG (DR_REG_INTERRUPT_BASE + 0xf4)

/* INTERRUPT_PRO_TIMER_INT2_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map TIMER_INT2 interrupt signal to one of the
 * CPU interrupts.
 */

#define INTERRUPT_PRO_TIMER_INT2_MAP    0x0000001F
#define INTERRUPT_PRO_TIMER_INT2_MAP_M  (INTERRUPT_PRO_TIMER_INT2_MAP_V << INTERRUPT_PRO_TIMER_INT2_MAP_S)
#define INTERRUPT_PRO_TIMER_INT2_MAP_V  0x0000001F
#define INTERRUPT_PRO_TIMER_INT2_MAP_S  0

/* INTERRUPT_PRO_TG_T0_EDGE_INT_MAP_REG register
 * TG_T0_EDGE_INT interrupt configuration register
 */

#define INTERRUPT_PRO_TG_T0_EDGE_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xf8)

/* INTERRUPT_PRO_TG_T0_EDGE_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map TG_T0_EDGE_INT interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_TG_T0_EDGE_INT_MAP    0x0000001F
#define INTERRUPT_PRO_TG_T0_EDGE_INT_MAP_M  (INTERRUPT_PRO_TG_T0_EDGE_INT_MAP_V << INTERRUPT_PRO_TG_T0_EDGE_INT_MAP_S)
#define INTERRUPT_PRO_TG_T0_EDGE_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_TG_T0_EDGE_INT_MAP_S  0

/* INTERRUPT_PRO_TG_T1_EDGE_INT_MAP_REG register
 * TG_T1_EDGE_INT interrupt configuration register
 */

#define INTERRUPT_PRO_TG_T1_EDGE_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xfc)

/* INTERRUPT_PRO_TG_T1_EDGE_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map TG_T1_EDGE_INT interrupt signal to one of
 * the CPU interrupts.
 */

