apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_interrupt.h
#define INTERRUPT_PRO_TG_T1_EDGE_INT_MAP    0x0000001F
#define INTERRUPT_PRO_TG_T1_EDGE_INT_MAP_M  (INTERRUPT_PRO_TG_T1_EDGE_INT_MAP_V << INTERRUPT_PRO_TG_T1_EDGE_INT_MAP_S)
#define INTERRUPT_PRO_TG_T1_EDGE_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_TG_T1_EDGE_INT_MAP_S  0

/* INTERRUPT_PRO_TG_WDT_EDGE_INT_MAP_REG register
 * TG_WDT_EDGE_INT interrupt configuration register
 */

#define INTERRUPT_PRO_TG_WDT_EDGE_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x100)

/* INTERRUPT_PRO_TG_WDT_EDGE_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map TG_WDT_EDGE_INT interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_TG_WDT_EDGE_INT_MAP    0x0000001F
#define INTERRUPT_PRO_TG_WDT_EDGE_INT_MAP_M  (INTERRUPT_PRO_TG_WDT_EDGE_INT_MAP_V << INTERRUPT_PRO_TG_WDT_EDGE_INT_MAP_S)
#define INTERRUPT_PRO_TG_WDT_EDGE_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_TG_WDT_EDGE_INT_MAP_S  0

/* INTERRUPT_PRO_TG_LACT_EDGE_INT_MAP_REG register
 * TG_LACT_EDGE_INT interrupt configuration register
 */

#define INTERRUPT_PRO_TG_LACT_EDGE_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x104)

/* INTERRUPT_PRO_TG_LACT_EDGE_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map TG_LACT_EDGE_INT interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_TG_LACT_EDGE_INT_MAP    0x0000001F
#define INTERRUPT_PRO_TG_LACT_EDGE_INT_MAP_M  (INTERRUPT_PRO_TG_LACT_EDGE_INT_MAP_V << INTERRUPT_PRO_TG_LACT_EDGE_INT_MAP_S)
#define INTERRUPT_PRO_TG_LACT_EDGE_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_TG_LACT_EDGE_INT_MAP_S  0

/* INTERRUPT_PRO_TG1_T0_EDGE_INT_MAP_REG register
 * TG1_T0_EDGE_INT interrupt configuration register
 */

#define INTERRUPT_PRO_TG1_T0_EDGE_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x108)

/* INTERRUPT_PRO_TG1_T0_EDGE_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map TG1_T0_EDGE_INT interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_TG1_T0_EDGE_INT_MAP    0x0000001F
#define INTERRUPT_PRO_TG1_T0_EDGE_INT_MAP_M  (INTERRUPT_PRO_TG1_T0_EDGE_INT_MAP_V << INTERRUPT_PRO_TG1_T0_EDGE_INT_MAP_S)
#define INTERRUPT_PRO_TG1_T0_EDGE_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_TG1_T0_EDGE_INT_MAP_S  0

/* INTERRUPT_PRO_TG1_T1_EDGE_INT_MAP_REG register
 * TG1_T1_EDGE_INT interrupt configuration register
 */

#define INTERRUPT_PRO_TG1_T1_EDGE_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x10c)

/* INTERRUPT_PRO_TG1_T1_EDGE_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map TG1_T1_EDGE_INT interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_TG1_T1_EDGE_INT_MAP    0x0000001F
#define INTERRUPT_PRO_TG1_T1_EDGE_INT_MAP_M  (INTERRUPT_PRO_TG1_T1_EDGE_INT_MAP_V << INTERRUPT_PRO_TG1_T1_EDGE_INT_MAP_S)
#define INTERRUPT_PRO_TG1_T1_EDGE_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_TG1_T1_EDGE_INT_MAP_S  0

/* INTERRUPT_PRO_TG1_WDT_EDGE_INT_MAP_REG register
 * TG1_WDT_EDGE_INT interrupt configuration register
 */

#define INTERRUPT_PRO_TG1_WDT_EDGE_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x110)

/* INTERRUPT_PRO_TG1_WDT_EDGE_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map TG1_WDT_EDGE_INT interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_TG1_WDT_EDGE_INT_MAP    0x0000001F
#define INTERRUPT_PRO_TG1_WDT_EDGE_INT_MAP_M  (INTERRUPT_PRO_TG1_WDT_EDGE_INT_MAP_V << INTERRUPT_PRO_TG1_WDT_EDGE_INT_MAP_S)
#define INTERRUPT_PRO_TG1_WDT_EDGE_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_TG1_WDT_EDGE_INT_MAP_S  0

/* INTERRUPT_PRO_TG1_LACT_EDGE_INT_MAP_REG register
 * TG1_LACT_EDGE_INT interrupt configuration register
 */

#define INTERRUPT_PRO_TG1_LACT_EDGE_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x114)

/* INTERRUPT_PRO_TG1_LACT_EDGE_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map TG1_LACT_EDGE_INT interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_TG1_LACT_EDGE_INT_MAP    0x0000001F
#define INTERRUPT_PRO_TG1_LACT_EDGE_INT_MAP_M  (INTERRUPT_PRO_TG1_LACT_EDGE_INT_MAP_V << INTERRUPT_PRO_TG1_LACT_EDGE_INT_MAP_S)
#define INTERRUPT_PRO_TG1_LACT_EDGE_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_TG1_LACT_EDGE_INT_MAP_S  0

/* INTERRUPT_PRO_CACHE_IA_INT_MAP_REG register
 * CACHE_IA_INT interrupt configuration register
 */

#define INTERRUPT_PRO_CACHE_IA_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x118)

/* INTERRUPT_PRO_CACHE_IA_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map CACHE_IA_INT interrupt signal to one of the
 * CPU interrupts.
 */

#define INTERRUPT_PRO_CACHE_IA_INT_MAP    0x0000001F
#define INTERRUPT_PRO_CACHE_IA_INT_MAP_M  (INTERRUPT_PRO_CACHE_IA_INT_MAP_V << INTERRUPT_PRO_CACHE_IA_INT_MAP_S)
#define INTERRUPT_PRO_CACHE_IA_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_CACHE_IA_INT_MAP_S  0

/* INTERRUPT_PRO_SYSTIMER_TARGET0_INT_MAP_REG register
 * SYSTIMER_TARGET0_INT interrupt configuration register
 */

#define INTERRUPT_PRO_SYSTIMER_TARGET0_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x11c)

/* INTERRUPT_PRO_SYSTIMER_TARGET0_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map SYSTIMER_TARGET0_INT interrupt signal to one
 * of the CPU interrupts.
 */

#define INTERRUPT_PRO_SYSTIMER_TARGET0_INT_MAP    0x0000001F
#define INTERRUPT_PRO_SYSTIMER_TARGET0_INT_MAP_M  (INTERRUPT_PRO_SYSTIMER_TARGET0_INT_MAP_V << INTERRUPT_PRO_SYSTIMER_TARGET0_INT_MAP_S)
#define INTERRUPT_PRO_SYSTIMER_TARGET0_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_SYSTIMER_TARGET0_INT_MAP_S  0

/* INTERRUPT_PRO_SYSTIMER_TARGET1_INT_MAP_REG register
 * SYSTIMER_TARGET1_INT interrupt configuration register
 */

#define INTERRUPT_PRO_SYSTIMER_TARGET1_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x120)

/* INTERRUPT_PRO_SYSTIMER_TARGET1_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map SYSTIMER_TARGET1_INT interrupt signal to one
 * of the CPU interrupts.
 */

#define INTERRUPT_PRO_SYSTIMER_TARGET1_INT_MAP    0x0000001F
#define INTERRUPT_PRO_SYSTIMER_TARGET1_INT_MAP_M  (INTERRUPT_PRO_SYSTIMER_TARGET1_INT_MAP_V << INTERRUPT_PRO_SYSTIMER_TARGET1_INT_MAP_S)
#define INTERRUPT_PRO_SYSTIMER_TARGET1_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_SYSTIMER_TARGET1_INT_MAP_S  0

/* INTERRUPT_PRO_SYSTIMER_TARGET2_INT_MAP_REG register
 * SYSTIMER_TARGET2_INT interrupt configuration register
 */

#define INTERRUPT_PRO_SYSTIMER_TARGET2_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x124)

/* INTERRUPT_PRO_SYSTIMER_TARGET2_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map SYSTIMER_TARGET2_INT interrupt signal to one
 * of the CPU interrupts.
 */

