apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_interrupt.h
#define INTERRUPT_PRO_SYSTIMER_TARGET2_INT_MAP    0x0000001F
#define INTERRUPT_PRO_SYSTIMER_TARGET2_INT_MAP_M  (INTERRUPT_PRO_SYSTIMER_TARGET2_INT_MAP_V << INTERRUPT_PRO_SYSTIMER_TARGET2_INT_MAP_S)
#define INTERRUPT_PRO_SYSTIMER_TARGET2_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_SYSTIMER_TARGET2_INT_MAP_S  0

/* INTERRUPT_PRO_ASSIST_DEBUG_INTR_MAP_REG register
 * ASSIST_DEBUG_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_ASSIST_DEBUG_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x128)

/* INTERRUPT_PRO_ASSIST_DEBUG_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map ASSIST_DEBUG_INTR interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_ASSIST_DEBUG_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_ASSIST_DEBUG_INTR_MAP_M  (INTERRUPT_PRO_ASSIST_DEBUG_INTR_MAP_V << INTERRUPT_PRO_ASSIST_DEBUG_INTR_MAP_S)
#define INTERRUPT_PRO_ASSIST_DEBUG_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_ASSIST_DEBUG_INTR_MAP_S  0

/* INTERRUPT_PRO_PMS_PRO_IRAM0_ILG_INTR_MAP_REG register
 * PMS_PRO_IRAM0_ILG interrupt configuration register
 */

#define INTERRUPT_PRO_PMS_PRO_IRAM0_ILG_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x12c)

/* INTERRUPT_PRO_PMS_PRO_IRAM0_ILG_INTR_MAP : R/W; bitpos: [4:0]; default:
 * 16;
 * This register is used to map PMS_PRO_IRAM0_ILG interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_PMS_PRO_IRAM0_ILG_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_PMS_PRO_IRAM0_ILG_INTR_MAP_M  (INTERRUPT_PRO_PMS_PRO_IRAM0_ILG_INTR_MAP_V << INTERRUPT_PRO_PMS_PRO_IRAM0_ILG_INTR_MAP_S)
#define INTERRUPT_PRO_PMS_PRO_IRAM0_ILG_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_PMS_PRO_IRAM0_ILG_INTR_MAP_S  0

/* INTERRUPT_PRO_PMS_PRO_DRAM0_ILG_INTR_MAP_REG register
 * PMS_PRO_DRAM0_ILG interrupt configuration register
 */

#define INTERRUPT_PRO_PMS_PRO_DRAM0_ILG_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x130)

/* INTERRUPT_PRO_PMS_PRO_DRAM0_ILG_INTR_MAP : R/W; bitpos: [4:0]; default:
 * 16;
 * This register is used to map PMS_PRO_DRAM0_ILG interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_PMS_PRO_DRAM0_ILG_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_PMS_PRO_DRAM0_ILG_INTR_MAP_M  (INTERRUPT_PRO_PMS_PRO_DRAM0_ILG_INTR_MAP_V << INTERRUPT_PRO_PMS_PRO_DRAM0_ILG_INTR_MAP_S)
#define INTERRUPT_PRO_PMS_PRO_DRAM0_ILG_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_PMS_PRO_DRAM0_ILG_INTR_MAP_S  0

/* INTERRUPT_PRO_PMS_PRO_DPORT_ILG_INTR_MAP_REG register
 * PMS_PRO_DPORT_ILG interrupt configuration register
 */

#define INTERRUPT_PRO_PMS_PRO_DPORT_ILG_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x134)

/* INTERRUPT_PRO_PMS_PRO_DPORT_ILG_INTR_MAP : R/W; bitpos: [4:0]; default:
 * 16;
 * This register is used to map PMS_PRO_DPORT_ILG interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_PMS_PRO_DPORT_ILG_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_PMS_PRO_DPORT_ILG_INTR_MAP_M  (INTERRUPT_PRO_PMS_PRO_DPORT_ILG_INTR_MAP_V << INTERRUPT_PRO_PMS_PRO_DPORT_ILG_INTR_MAP_S)
#define INTERRUPT_PRO_PMS_PRO_DPORT_ILG_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_PMS_PRO_DPORT_ILG_INTR_MAP_S  0

/* INTERRUPT_PRO_PMS_PRO_AHB_ILG_INTR_MAP_REG register
 * PMS_PRO_AHB_ILG interrupt configuration register
 */

#define INTERRUPT_PRO_PMS_PRO_AHB_ILG_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x138)

/* INTERRUPT_PRO_PMS_PRO_AHB_ILG_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map PMS_PRO_AHB_ILG interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_PMS_PRO_AHB_ILG_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_PMS_PRO_AHB_ILG_INTR_MAP_M  (INTERRUPT_PRO_PMS_PRO_AHB_ILG_INTR_MAP_V << INTERRUPT_PRO_PMS_PRO_AHB_ILG_INTR_MAP_S)
#define INTERRUPT_PRO_PMS_PRO_AHB_ILG_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_PMS_PRO_AHB_ILG_INTR_MAP_S  0

/* INTERRUPT_PRO_PMS_PRO_CACHE_ILG_INTR_MAP_REG register
 * PMS_PRO_CACHE_ILG interrupt configuration register
 */

#define INTERRUPT_PRO_PMS_PRO_CACHE_ILG_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x13c)

/* INTERRUPT_PRO_PMS_PRO_CACHE_ILG_INTR_MAP : R/W; bitpos: [4:0]; default:
 * 16;
 * This register is used to map PMS_PRO_CACHE_ILG interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_PMS_PRO_CACHE_ILG_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_PMS_PRO_CACHE_ILG_INTR_MAP_M  (INTERRUPT_PRO_PMS_PRO_CACHE_ILG_INTR_MAP_V << INTERRUPT_PRO_PMS_PRO_CACHE_ILG_INTR_MAP_S)
#define INTERRUPT_PRO_PMS_PRO_CACHE_ILG_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_PMS_PRO_CACHE_ILG_INTR_MAP_S  0

/* INTERRUPT_PRO_PMS_DMA_APB_I_ILG_INTR_MAP_REG register
 * PMS_DMA_APB_I_ILG  interrupt configuration register
 */

#define INTERRUPT_PRO_PMS_DMA_APB_I_ILG_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x140)

/* INTERRUPT_PRO_PMS_DMA_APB_I_ILG_INTR_MAP : R/W; bitpos: [4:0]; default:
 * 16;
 * This register is used to map PMS_DMA_APB_I_ILG interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_PMS_DMA_APB_I_ILG_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_PMS_DMA_APB_I_ILG_INTR_MAP_M  (INTERRUPT_PRO_PMS_DMA_APB_I_ILG_INTR_MAP_V << INTERRUPT_PRO_PMS_DMA_APB_I_ILG_INTR_MAP_S)
#define INTERRUPT_PRO_PMS_DMA_APB_I_ILG_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_PMS_DMA_APB_I_ILG_INTR_MAP_S  0

/* INTERRUPT_PRO_PMS_DMA_RX_I_ILG_INTR_MAP_REG register
 * PMS_DMA_RX_I_ILG interrupt configuration register
 */

#define INTERRUPT_PRO_PMS_DMA_RX_I_ILG_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x144)

/* INTERRUPT_PRO_PMS_DMA_RX_I_ILG_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map PMS_DMA_RX_I_ILG interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_PMS_DMA_RX_I_ILG_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_PMS_DMA_RX_I_ILG_INTR_MAP_M  (INTERRUPT_PRO_PMS_DMA_RX_I_ILG_INTR_MAP_V << INTERRUPT_PRO_PMS_DMA_RX_I_ILG_INTR_MAP_S)
#define INTERRUPT_PRO_PMS_DMA_RX_I_ILG_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_PMS_DMA_RX_I_ILG_INTR_MAP_S  0

/* INTERRUPT_PRO_PMS_DMA_TX_I_ILG_INTR_MAP_REG register
 * PMS_DMA_TX_I_ILG interrupt configuration register
 */

#define INTERRUPT_PRO_PMS_DMA_TX_I_ILG_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x148)

/* INTERRUPT_PRO_PMS_DMA_TX_I_ILG_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map PMS_DMA_TX_I_ILG interrupt signal to one of
 * the CPU interrupts.
 */

