apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_interrupt.h
#define INTERRUPT_PRO_PMS_DMA_TX_I_ILG_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_PMS_DMA_TX_I_ILG_INTR_MAP_M  (INTERRUPT_PRO_PMS_DMA_TX_I_ILG_INTR_MAP_V << INTERRUPT_PRO_PMS_DMA_TX_I_ILG_INTR_MAP_S)
#define INTERRUPT_PRO_PMS_DMA_TX_I_ILG_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_PMS_DMA_TX_I_ILG_INTR_MAP_S  0

/* INTERRUPT_PRO_SPI_MEM_REJECT_INTR_MAP_REG register
 * SPI_MEM_REJECT_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_SPI_MEM_REJECT_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x14c)

/* INTERRUPT_PRO_SPI_MEM_REJECT_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map SPI_MEM_REJECT_INTR interrupt signal to one
 * of the CPU interrupts.
 */

#define INTERRUPT_PRO_SPI_MEM_REJECT_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_SPI_MEM_REJECT_INTR_MAP_M  (INTERRUPT_PRO_SPI_MEM_REJECT_INTR_MAP_V << INTERRUPT_PRO_SPI_MEM_REJECT_INTR_MAP_S)
#define INTERRUPT_PRO_SPI_MEM_REJECT_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_SPI_MEM_REJECT_INTR_MAP_S  0

/* INTERRUPT_PRO_DMA_COPY_INTR_MAP_REG register
 * DMA_COPY_INTR interrupt configuration register
 */

#define INTERRUPT_PRO_DMA_COPY_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x150)

/* INTERRUPT_PRO_DMA_COPY_INTR_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map DMA_COPY_INTR interrupt signal to one of the
 * CPU interrupts.
 */

#define INTERRUPT_PRO_DMA_COPY_INTR_MAP    0x0000001F
#define INTERRUPT_PRO_DMA_COPY_INTR_MAP_M  (INTERRUPT_PRO_DMA_COPY_INTR_MAP_V << INTERRUPT_PRO_DMA_COPY_INTR_MAP_S)
#define INTERRUPT_PRO_DMA_COPY_INTR_MAP_V  0x0000001F
#define INTERRUPT_PRO_DMA_COPY_INTR_MAP_S  0

/* INTERRUPT_PRO_SPI4_DMA_INT_MAP_REG register
 * SPI4_DMA_INT interrupt configuration register
 */

#define INTERRUPT_PRO_SPI4_DMA_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x154)

/* INTERRUPT_PRO_SPI4_DMA_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map SPI4_DMA_INT interrupt signal to one of the
 * CPU interrupts.
 */

#define INTERRUPT_PRO_SPI4_DMA_INT_MAP    0x0000001F
#define INTERRUPT_PRO_SPI4_DMA_INT_MAP_M  (INTERRUPT_PRO_SPI4_DMA_INT_MAP_V << INTERRUPT_PRO_SPI4_DMA_INT_MAP_S)
#define INTERRUPT_PRO_SPI4_DMA_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_SPI4_DMA_INT_MAP_S  0

/* INTERRUPT_PRO_SPI_INTR_4_MAP_REG register
 * SPI_INTR_4 interrupt configuration register
 */

#define INTERRUPT_PRO_SPI_INTR_4_MAP_REG (DR_REG_INTERRUPT_BASE + 0x158)

/* INTERRUPT_PRO_SPI_INTR_4_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map SPI_INTR_4 interrupt signal to one of the
 * CPU interrupts.
 */

#define INTERRUPT_PRO_SPI_INTR_4_MAP    0x0000001F
#define INTERRUPT_PRO_SPI_INTR_4_MAP_M  (INTERRUPT_PRO_SPI_INTR_4_MAP_V << INTERRUPT_PRO_SPI_INTR_4_MAP_S)
#define INTERRUPT_PRO_SPI_INTR_4_MAP_V  0x0000001F
#define INTERRUPT_PRO_SPI_INTR_4_MAP_S  0

/* INTERRUPT_PRO_DCACHE_PRELOAD_INT_MAP_REG register
 * DCACHE_PRELOAD_INT interrupt configuration register
 */

#define INTERRUPT_PRO_DCACHE_PRELOAD_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x15c)

/* INTERRUPT_PRO_DCACHE_PRELOAD_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map DCACHE_PRELOAD_INT interrupt signal to one
 * of the CPU interrupts.
 */

#define INTERRUPT_PRO_DCACHE_PRELOAD_INT_MAP    0x0000001F
#define INTERRUPT_PRO_DCACHE_PRELOAD_INT_MAP_M  (INTERRUPT_PRO_DCACHE_PRELOAD_INT_MAP_V << INTERRUPT_PRO_DCACHE_PRELOAD_INT_MAP_S)
#define INTERRUPT_PRO_DCACHE_PRELOAD_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_DCACHE_PRELOAD_INT_MAP_S  0

/* INTERRUPT_PRO_ICACHE_PRELOAD_INT_MAP_REG register
 * ICACHE_PRELOAD_INT interrupt configuration register
 */

#define INTERRUPT_PRO_ICACHE_PRELOAD_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x160)

/* INTERRUPT_PRO_ICACHE_PRELOAD_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map ICACHE_PRELOAD_INT interrupt signal to one
 * of the CPU interrupts.
 */

#define INTERRUPT_PRO_ICACHE_PRELOAD_INT_MAP    0x0000001F
#define INTERRUPT_PRO_ICACHE_PRELOAD_INT_MAP_M  (INTERRUPT_PRO_ICACHE_PRELOAD_INT_MAP_V << INTERRUPT_PRO_ICACHE_PRELOAD_INT_MAP_S)
#define INTERRUPT_PRO_ICACHE_PRELOAD_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_ICACHE_PRELOAD_INT_MAP_S  0

/* INTERRUPT_PRO_APB_ADC_INT_MAP_REG register
 * APB_ADC_INT interrupt configuration register
 */

#define INTERRUPT_PRO_APB_ADC_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x164)

/* INTERRUPT_PRO_APB_ADC_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map APB_ADC_INT interrupt signal to one of the
 * CPU interrupts.
 */

#define INTERRUPT_PRO_APB_ADC_INT_MAP    0x0000001F
#define INTERRUPT_PRO_APB_ADC_INT_MAP_M  (INTERRUPT_PRO_APB_ADC_INT_MAP_V << INTERRUPT_PRO_APB_ADC_INT_MAP_S)
#define INTERRUPT_PRO_APB_ADC_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_APB_ADC_INT_MAP_S  0

/* INTERRUPT_PRO_CRYPTO_DMA_INT_MAP_REG register
 * CRYPTO_DMA_INT interrupt configuration register
 */

#define INTERRUPT_PRO_CRYPTO_DMA_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x168)

/* INTERRUPT_PRO_CRYPTO_DMA_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map CRYPTO_DMA_INT interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_CRYPTO_DMA_INT_MAP    0x0000001F
#define INTERRUPT_PRO_CRYPTO_DMA_INT_MAP_M  (INTERRUPT_PRO_CRYPTO_DMA_INT_MAP_V << INTERRUPT_PRO_CRYPTO_DMA_INT_MAP_S)
#define INTERRUPT_PRO_CRYPTO_DMA_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_CRYPTO_DMA_INT_MAP_S  0

/* INTERRUPT_PRO_CPU_PERI_ERROR_INT_MAP_REG register
 * CPU_PERI_ERROR_INT interrupt configuration register
 */

#define INTERRUPT_PRO_CPU_PERI_ERROR_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x16c)

/* INTERRUPT_PRO_CPU_PERI_ERROR_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map CPU_PERI_ERROR_INT interrupt signal to one
 * of the CPU interrupts.
 */

#define INTERRUPT_PRO_CPU_PERI_ERROR_INT_MAP    0x0000001F
#define INTERRUPT_PRO_CPU_PERI_ERROR_INT_MAP_M  (INTERRUPT_PRO_CPU_PERI_ERROR_INT_MAP_V << INTERRUPT_PRO_CPU_PERI_ERROR_INT_MAP_S)
#define INTERRUPT_PRO_CPU_PERI_ERROR_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_CPU_PERI_ERROR_INT_MAP_S  0

/* INTERRUPT_PRO_APB_PERI_ERROR_INT_MAP_REG register
 * APB_PERI_ERROR_INT interrupt configuration register
 */

#define INTERRUPT_PRO_APB_PERI_ERROR_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x170)

