apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_interrupt.h
/* INTERRUPT_PRO_APB_PERI_ERROR_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map APB_PERI_ERROR_INT interrupt signal to one
 * of the CPU interrupts.
 */

#define INTERRUPT_PRO_APB_PERI_ERROR_INT_MAP    0x0000001F
#define INTERRUPT_PRO_APB_PERI_ERROR_INT_MAP_M  (INTERRUPT_PRO_APB_PERI_ERROR_INT_MAP_V << INTERRUPT_PRO_APB_PERI_ERROR_INT_MAP_S)
#define INTERRUPT_PRO_APB_PERI_ERROR_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_APB_PERI_ERROR_INT_MAP_S  0

/* INTERRUPT_PRO_DCACHE_SYNC_INT_MAP_REG register
 * DCACHE_SYNC_INT interrupt configuration register
 */

#define INTERRUPT_PRO_DCACHE_SYNC_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x174)

/* INTERRUPT_PRO_DCACHE_SYNC_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map DCACHE_SYNC_INT interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_DCACHE_SYNC_INT_MAP    0x0000001F
#define INTERRUPT_PRO_DCACHE_SYNC_INT_MAP_M  (INTERRUPT_PRO_DCACHE_SYNC_INT_MAP_V << INTERRUPT_PRO_DCACHE_SYNC_INT_MAP_S)
#define INTERRUPT_PRO_DCACHE_SYNC_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_DCACHE_SYNC_INT_MAP_S  0

/* INTERRUPT_PRO_ICACHE_SYNC_INT_MAP_REG register
 * ICACHE_SYNC_INT interrupt configuration register
 */

#define INTERRUPT_PRO_ICACHE_SYNC_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x178)

/* INTERRUPT_PRO_ICACHE_SYNC_INT_MAP : R/W; bitpos: [4:0]; default: 16;
 * This register is used to map ICACHE_SYNC_INT interrupt signal to one of
 * the CPU interrupts.
 */

#define INTERRUPT_PRO_ICACHE_SYNC_INT_MAP    0x0000001F
#define INTERRUPT_PRO_ICACHE_SYNC_INT_MAP_M  (INTERRUPT_PRO_ICACHE_SYNC_INT_MAP_V << INTERRUPT_PRO_ICACHE_SYNC_INT_MAP_S)
#define INTERRUPT_PRO_ICACHE_SYNC_INT_MAP_V  0x0000001F
#define INTERRUPT_PRO_ICACHE_SYNC_INT_MAP_S  0

/* INTERRUPT_PRO_INTR_STATUS_REG_0_REG register
 * Interrupt status register 0
 */

#define INTERRUPT_PRO_INTR_STATUS_REG_0_REG (DR_REG_INTERRUPT_BASE + 0x17c)

/* INTERRUPT_PRO_INTR_STATUS_0 : RO; bitpos: [31:0]; default: 0;
 * This register stores the status of the first 32 input interrupt sources.
 */

#define INTERRUPT_PRO_INTR_STATUS_0    0xFFFFFFFF
#define INTERRUPT_PRO_INTR_STATUS_0_M  (INTERRUPT_PRO_INTR_STATUS_0_V << INTERRUPT_PRO_INTR_STATUS_0_S)
#define INTERRUPT_PRO_INTR_STATUS_0_V  0xFFFFFFFF
#define INTERRUPT_PRO_INTR_STATUS_0_S  0

/* INTERRUPT_PRO_INTR_STATUS_REG_1_REG register
 * Interrupt status register 1
 */

#define INTERRUPT_PRO_INTR_STATUS_REG_1_REG (DR_REG_INTERRUPT_BASE + 0x180)

/* INTERRUPT_PRO_INTR_STATUS_1 : RO; bitpos: [31:0]; default: 0;
 * This register stores the status of the second 32 input interrupt sources.
 */

#define INTERRUPT_PRO_INTR_STATUS_1    0xFFFFFFFF
#define INTERRUPT_PRO_INTR_STATUS_1_M  (INTERRUPT_PRO_INTR_STATUS_1_V << INTERRUPT_PRO_INTR_STATUS_1_S)
#define INTERRUPT_PRO_INTR_STATUS_1_V  0xFFFFFFFF
#define INTERRUPT_PRO_INTR_STATUS_1_S  0

/* INTERRUPT_PRO_INTR_STATUS_REG_2_REG register
 * Interrupt status register 2
 */

#define INTERRUPT_PRO_INTR_STATUS_REG_2_REG (DR_REG_INTERRUPT_BASE + 0x184)

/* INTERRUPT_PRO_INTR_STATUS_2 : RO; bitpos: [31:0]; default: 0;
 * This register stores the status of the last 31 input interrupt sources.
 */

#define INTERRUPT_PRO_INTR_STATUS_2    0xFFFFFFFF
#define INTERRUPT_PRO_INTR_STATUS_2_M  (INTERRUPT_PRO_INTR_STATUS_2_V << INTERRUPT_PRO_INTR_STATUS_2_S)
#define INTERRUPT_PRO_INTR_STATUS_2_V  0xFFFFFFFF
#define INTERRUPT_PRO_INTR_STATUS_2_S  0

/* INTERRUPT_CLOCK_GATE_REG register
 * NMI interrupt signals mask register
 */

#define INTERRUPT_CLOCK_GATE_REG (DR_REG_INTERRUPT_BASE + 0x188)

/* INTERRUPT_PRO_NMI_MASK_HW : R/W; bitpos: [1]; default: 0;
 * This bit is used to disable all NMI interrupt signals to CPU.
 */

#define INTERRUPT_PRO_NMI_MASK_HW    (BIT(1))
#define INTERRUPT_PRO_NMI_MASK_HW_M  (INTERRUPT_PRO_NMI_MASK_HW_V << INTERRUPT_PRO_NMI_MASK_HW_S)
#define INTERRUPT_PRO_NMI_MASK_HW_V  0x00000001
#define INTERRUPT_PRO_NMI_MASK_HW_S  1

/* INTERRUPT_CLK_EN : R/W; bitpos: [0]; default: 1;
 * This bit is used to enable or disable the clock of interrupt matrix. 1:
 * enable the clock. 0: disable the clock.
 */

#define INTERRUPT_CLK_EN    (BIT(0))
#define INTERRUPT_CLK_EN_M  (INTERRUPT_CLK_EN_V << INTERRUPT_CLK_EN_S)
#define INTERRUPT_CLK_EN_V  0x00000001
#define INTERRUPT_CLK_EN_S  0

/* INTERRUPT_REG_DATE_REG register
 * Version control register
 */

#define INTERRUPT_REG_DATE_REG (DR_REG_INTERRUPT_BASE + 0xffc)

/* INTERRUPT_INTERRUPT_REG_DATE : R/W; bitpos: [27:0]; default: 26231168;
 * This is the version register.
 */

#define INTERRUPT_INTERRUPT_REG_DATE    0x0FFFFFFF
#define INTERRUPT_INTERRUPT_REG_DATE_M  (INTERRUPT_INTERRUPT_REG_DATE_V << INTERRUPT_INTERRUPT_REG_DATE_S)
#define INTERRUPT_INTERRUPT_REG_DATE_V  0x0FFFFFFF
#define INTERRUPT_INTERRUPT_REG_DATE_S  0

#endif /* __ARCH_XTENSA_SRC_ESP32S2_HARDWARE_ESP32S2_INTERRUPT_H */
